## Модуль №1
## Основы программирования









## Модуль №2
## Как работает компьютерная программа?









## Модуль №3
## Из чего состоит язык?









## Модуль №4
## Компиляция и интерпретация









## Модуль №5
## Что на самом деле делает интерпретатор?









## Модуль №6
## Компиляция и интерпретация —
## преимущества и недостатки









## Модуль №7
## Что такое Python?









## Модуль №8
## Кто создал Python?









## Модуль №9
## Цели Python









## Модуль №10
## Почему Python особенный?









## Модуль №11
## Конкуренты Python?









## Модуль №12
## Где мы можем увидеть Python в действии?









## Модуль №13
## Python ака CPython









## Модуль №14
## Cython









## Модуль №15
## Jython









## Модуль №16
## PyPy и RPython









## Модуль №17
## Литералы Python










## Модуль №1
## Литералы — данные в себе









## Модуль №1
## Целые числа (Integers)









## Модуль №1
## Целые числа: восьмеричные
## и шестнадцатеричные числа








## Модуль №1
## Числа с плавающей точкой
## (Floating-point numbers)









## Модуль №1
## Кодирование чисел с плавающей точкой








## Модуль №1
## Строки








## Модуль №1
## Кодирование строк








## Модуль №1
## Булевы значения (логические типы данных)









## Модуль №1
## Ключевые выводы








## Модуль №1
## Операторы — инструменты управления данными









## Модуль №1
## Python как калькулятор








## Модуль №1
## Основные операторы









## Модуль №1
## Арифметические операторы:
## возведение в степень









## Модуль №1
## Арифметические операторы: умножение









## Модуль №1
## Арифметические операторы: деление









## Модуль №1
## Арифметические операторы:
## целочисленное деление








## Модуль №1
## Операторы: остаток
## (деление по модулю, с остатком)










## Модуль №1
## Операторы: как не делить









## Модуль №1
## Операторы: суммирование










## Модуль №1
## Оператор вычитания,
## унарные и бинарные операторы









## Модуль №1
## Модуль №1
## Модуль №1
## Модуль №1
## Модуль №1
## Модуль №1
## Модуль №1
## Модуль №1
## Модуль №1
## Модуль №1
## Модуль №1
## Модуль №1
## Модуль №1
## Модуль №1
## Модуль №1
## Модуль №1
## Модуль №1
## Модуль №1
## Модуль №1
## Модуль №1
## Модуль №1
## Модуль №1
## Модуль №1
## Модуль №1
## Модуль №1
## Модуль №1
## Модуль №1
## Модуль №1
## Модуль №1
## Модуль №1
## Модуль №1
## Модуль №1
## Модуль №1
## Модуль №1
