## Модуль №1
## Основы программирования









## Модуль №2
## Как работает компьютерная программа?









## Модуль №3
## Из чего состоит язык?









## Модуль №4
## Компиляция и интерпретация









## Модуль №5
## Что на самом деле делает интерпретатор?









## Модуль №6
## Компиляция и интерпретация —
## преимущества и недостатки









## Модуль №7
## Что такое Python?









## Модуль №8
## Кто создал Python?









## Модуль №9
## Цели Python









## Модуль №10
## Почему Python особенный?









## Модуль №11
## Конкуренты Python?









## Модуль №12
## Где мы можем увидеть Python в действии?









## Модуль №13
## Python ака CPython









## Модуль №14
## Cython









## Модуль №15
## Jython









## Модуль №16
## PyPy и RPython









## Модуль №17
## Литералы Python










## Модуль №18
## Литералы — данные в себе









## Модуль №19
## Целые числа (Integers)









## Модуль №20
## Целые числа: восьмеричные
## и шестнадцатеричные числа








## Модуль №21
## Числа с плавающей точкой
## (Floating-point numbers)









## Модуль №22
## Кодирование чисел с плавающей точкой








## Модуль №23
## Строки








## Модуль №24
## Кодирование строк








## Модуль №25
## Булевы значения (логические типы данных)









## Модуль №26
## Ключевые выводы








## Модуль №27
## Операторы — инструменты управления данными









## Модуль №28
## Python как калькулятор








## Модуль №29
## Основные операторы









## Модуль №30
## Арифметические операторы:
## возведение в степень









## Модуль №31
## Арифметические операторы: умножение









## Модуль №32
## Арифметические операторы: деление









## Модуль №33
## Арифметические операторы:
## целочисленное деление








## Модуль №34
## Операторы: остаток
## (деление по модулю, с остатком)










## Модуль №35
## Операторы: как не делить









## Модуль №36
## Операторы: суммирование










## Модуль №37
## Оператор вычитания,
## унарные и бинарные операторы









## Модуль №38
## Операторы и их приоритеты









## Модуль №39
## Операторы и связывание









## Модуль №40
## Операторы и связывание: возведение в степень









## Модуль №41
## Список приоритетов









## Модуль №42
## Операторы и скобки









## Модуль №43
## Переменные — поля в форме данных
## Что такое переменные?










## Модуль №44
## Правильные и неправильные имена переменных
## Ключевые слова













## Модуль №45
## Создание переменных












## Модуль №46
## Использование переменных













## Модуль №47
## Присвоение нового значения
## уже существующей переменной


















## Модуль №48
## Решение простых математических задач
















## Модуль №49
## Сокращенные формы записи
























## Модуль №50
## Ключевые выводы






























## Модуль №51
## Комментарий к комментариям
























## Модуль №52
## Комментарии в коде: зачем, как и когда





























## Модуль №53
## Ключевые выводы
































## Модуль №54
## Как общаться с компьютером
## Функция ввода input()
## Функция input() с аргументом
## Результат функции input()

## Функция input() — запрещенные операции





















## Модуль №55
## Преобразование типов



























## Модуль №56
## Больше об input() и преобразовании типов



























## Модуль №57
## Строковые операторы — введение


























## Модуль №58
## Конкатенация (concatenation)

























## Модуль №59
## Повторение строки (replication)






















## Модуль №60
## Преобразование типов: str()



























## Модуль №61
## Снова возвращаемся
## к прямоугольному треугольнику




























## Модуль №62




































## Модуль №63




























## Модуль №64



































## Модуль №65


























## Модуль №66



























## Модуль №67

























## Модуль №68





























## Модуль №69




































## Модуль №70































## Модуль №71
