## Модуль №1
## Основы программирования









## Модуль №1
## Как работает компьютерная программа?









## Модуль №1
Из чего состоит язык?









## Модуль №1
Компиляция и интерпретация









## Модуль №1
Что на самом деле делает интерпретатор?









## Модуль №1










## Модуль №1










## Модуль №1










## Модуль №1










## Модуль №1










## Модуль №1










## Модуль №1










## Модуль №1










## Модуль №1










## Модуль №1










## Модуль №1










## Модуль №1











## Модуль №1










## Модуль №1










## Модуль №1










## Модуль №1










## Модуль №1









## Модуль №1









## Модуль №1









## Модуль №1










## Модуль №1









## Модуль №1










## Модуль №1









## Модуль №1










## Модуль №1










## Модуль №1










## Модуль №1










## Модуль №1









## Модуль №1











## Модуль №1










## Модуль №1











## Модуль №1
