## Модуль №1
## Основы программирования









## Модуль №1
## Как работает компьютерная программа?









## Модуль №1
Из чего состоит язык?









## Модуль №1
Компиляция и интерпретация









## Модуль №1
Что на самом деле делает интерпретатор?









## Модуль №1
Компиляция и интерпретация —
преимущества и недостатки









## Модуль №1
Что такое Python?









## Модуль №1
Кто создал Python?









## Модуль №1
Цели Python









## Модуль №1
Почему Python особенный?









## Модуль №1
Конкуренты Python?









## Модуль №1
Где мы можем увидеть Python в действии?









## Модуль №1
Python ака CPython









## Модуль №1
Cython









## Модуль №1
Jython









## Модуль №1
PyPy и RPython









## Модуль №1
Литералы Python










## Модуль №1
Литералы — данные в себе









## Модуль №1
Целые числа (Integers)









## Модуль №1
Целые числа: восьмеричные
и шестнадцатеричные числа








## Модуль №1
Числа с плавающей точкой
(Floating-point numbers)









## Модуль №1
Кодирование чисел с плавающей точкой








## Модуль №1
Строки








## Модуль №1
Кодирование строк








## Модуль №1
Булевы значения (логические типы данных)









## Модуль №1
Ключевые выводы








## Модуль №1
Операторы — инструменты управления данными









## Модуль №1
Python как калькулятор








## Модуль №1










## Модуль №1










## Модуль №1










## Модуль №1










## Модуль №1









## Модуль №1











## Модуль №1










## Модуль №1











## Модуль №1
